Revit.Elements.DividedPath
A Revit DividedPath

Revit.Elements.DividedPath.#ctor(Autodesk.Revit.DB.DividedPath)
Construct a DSDividedPath from an existing one.
divPath:

Revit.Elements.DividedPath.#ctor(Revit.GeometryReferences.ElementCurveReference[],System.Int32)
Private constructor to build a DividedPath
c: Host curves
divs: Number of divisions

Revit.Elements.DividedPath.InitDividedPath(Autodesk.Revit.DB.DividedPath)
Initialize a DividedPath element
divPath:

Revit.Elements.DividedPath.InitDividedPath(Revit.GeometryReferences.ElementCurveReference[],System.Int32)
Initialize a DividedPath element
c: Host curves
divs: Number of divisions

Revit.Elements.DividedPath.InternalSetDividedPath(Autodesk.Revit.DB.DividedPath)
Set the internal object and update the id's
divPath: The divided path

Revit.Elements.DividedPath.ByCurveAndDivisions(Autodesk.DesignScript.Geometry.Curve,System.Int32)
Creates a Revit divided path on the given curve with specified amount of division
curve:
divisions:
Returns:

Revit.Elements.DividedPath.ByCurvesAndDivisions(Autodesk.DesignScript.Geometry.Curve[],System.Int32)
Creates a Revit divided path on the given collection of curves with specified amount of division
curve:
divisions:
Returns:

Revit.Elements.DividedPath.FromExisting(Autodesk.Revit.DB.DividedPath,System.Boolean)
Construct this type from an existing Revit element.
dividedPath:
isRevitOwned:
Returns:

Revit.Elements.DividedPath.InternalDividedPath
Internal variable containing the wrapped Revit object

Revit.Elements.DividedPath.InternalElement
Reference to the Element

Revit.Elements.DividedPath.Points
All points along the DividedPath.